{
  "Project Repository": "Project Repository",
  "Proofs": "Bewijsstukken",
  "Change Style": "Style Wisselen",
  "Bryant Suiskens": "Bryant Suiskens",
  "About Me": "Over Mij",
  "Where I've Been": "Mijn reis",
  "Skills": "Vaardigheden",
  "Internship": "Stage",
  "Projects": "Projecten",
  "Welcome Message": "Welkom bij het portfolio van Bryant Suiskens",
  "Roles Message": "Front-end ontwikkelaar en applicatie-ingenieur",
  "Invitation Message": "Leer me kennen",
  "October 15th": "15 oktober",
  "My Hobbies": "Mijn hobby's",
  "Born": "Geboren",
  "Phone": "Telefoon",
  "Contact": "Contact",
  "January": "januari",
  "February": "februari",
  "March": "maart",
  "April": "april",
  "May": "mei",
  "June": "juni",
  "Juli": "juli",
  "August": "augustus",
  "September": "september",
  "October": "oktober",
  "November": "november",
  "December": "december",
  "Relevant Documents": "Relevante Documenten",
  "Educational Tracks": "Educatieve Trajecten",
  "Work Experience": "Werkervaring",
  "Certifications": "Certificeringen",
  "AP IT Bachelor": "Bachelor Elektronica/IT aan Artesis-Plantijn College",
  "TM TP Bachelor": "Bachelor Toegepaste Psychologie aan Thomas More College",
  "TM IT Graduate": "Graduaat Programmeren aan Thomas More College",
  "TM IT Bachelor": "Bachelor Applicatieontwikkeling aan Thomas More College",
  "Warehouse Assistant": "Magazijn assistent",
  "React Programmer": "React Programmeur",
  "Programming Skills": "Programmeervaardigheden",
  "IT Skills": "IT-vaardigheden",
  "Soft Skills": "Soft Skills",
  "My Skills": "Mijn Vaardigheden",
  "Beginner": "Beginner",
  "Moderate": "Gemiddeld",
  "Specialist": "Specialisatie",
  "Experienced": "Ervaring",
  "Former Specialist": "Voormalige Specialisatie",
  "Deprecated": "Achterhaald",
  "Conversation Skills": "Gespreksvaardigheden",
  "Electronics": "Elektronica",
  "Cisco Networks": "Cisco-netwerken",
  ".NET Development in C#": ".NET-ontwikkeling in C#",
  "IoT Development": "IoT-ontwikkeling",
  "Internships": "Stages",
  "Assignment": "Opdracht",
  "Bachelor Internship": "Bachelor Stage",
  "Graduate Internship": "Graduaat stage",
  "My Projects": "Mijn Projecten",
  "Biography": "Ik ben een zeer gemotiveerde en ijverige werknemer, bekend om mijn unieke persoonlijkheid en onwrikbaar optimisme. Voormalige collega's en klasgenoten beschrijven me vaak als levendig, hardwerkend en oog voor detail. Ik geloof sterk in het bevorderen van een samenwerkingsgerichte omgeving, waarbij elk teamlid zich gewaardeerd voelt en actief betrokken is bij onze projecten.",
  "About My Hobbies": "Naast het werken aan individuele programmeerprojecten, zoals het ontwikkelen van Unity-games, zorg ik ervoor dat ik mijn vrije tijd effectief benut. Ik geniet van activiteiten zoals het spelen van videospellen, naar de sportschool gaan en mijn passie voor bakken verkennen. Elke week neem ik mezelf voor om een aanbod aan verrukkelijke gebakjes te creëren. Helaas zijn de hoeveelheden vaak te groot voor mijn eigen gezin om op te eten. Als gevolg daarvan is het een gewoonte geworden om de vruchten van mijn arbeid te delen met vrienden en collega's, waardoor ik niet alleen vreugde, maar ook heerlijke smaken met hen kan delen.",
  "Bachelor AP": "Na mijn middelbare school begon ik aan een 3-jarig avontuur om een bachelorsdiploma te behalen. Het eerste jaar verliep voorspoedig, maar persoonlijke omstandigheden zorgden ervoor dat ik tijdens het tweede jaar compleet uitgeput raakte. Door mijn overmatige neiging tot uitstelgedrag raakte ik verstrikt in steeds stressvollere situaties, waardoor ik langzaam maar zeker afstand nam van de weinige vrienden die ik had weten te maken. Na een jaar van strijd besloot ik om psychologische hulp te zoeken en medicatie te gebruiken. Pas toen besefte ik dat mijn passie voor IT (voor nu) was gedoofd. Daarom nam ik het tweede semester als een sabbatical om te werken aan mijn mentale gezondheid en mijn motivatie weer te laten ontvlammen, tot het onverwoestbare vuur dat het nu is.",
  "Bachelor Psychology": "Met hernieuwde motivatie en de harde lessen van mijn eerste bachelor in gedachten, besloot ik deze bacheloropleiding te volgen om mijn sociale vaardigheden en communicatieve capaciteiten aan te scherpen. Ik zette me vol overgave in op sociaal gebied en behaalde hierin groot succes. De karakterontwikkeling die ik gedurende dit jaar heb doorgemaakt, heeft mijn leven werkelijk veranderd. Helaas was het lot van deze bacheloropleiding bezegeld; zodra we de theoretische fase achter ons lieten en begonnen met de praktijk, werd het al snel duidelijk dat ik nog veel te leren had, meer dan wat ik kon bereiken in de beperkte tijd die me restte. Na een bijzonder desastreus praktijkexamen moest ik de harde realiteit onder ogen zien en weer mijn eigen pad volgen. Gewapend met deze nieuwe levenservaring en hernieuwde motivatie, keerde ik terug naar de wereld van programmeren, vastberaden om succesvol te zijn.",
  "Graduate Programming": "Doorheen de loop van de richting, stond ik aan de top van de klas in programmeervaardigheid. Waar ik in mijn bachelor gehinderd werd door motivatie tekort, uitstelgedrag en asociaal gedrag, stortte ik mij nu op mijn studies met een ijver die mijn oude zelf vreemd was geweest. Al mijn projecten werden op tijd en met vlijt ingediend, ik was een steunpilaar van de klas en bouwde een goede band op met mijn klasgenoten. Deze twee jaar waren mijn beste jaren tot nu toe en ze lieten geen twijfel over mijn toekomst als programmeur. Aan het einde van deze opleiding ben ik met grote onderscheiding afgestudeerd.",
  "Bachelor Programming": "En zo begaven we ons op weg naar nieuwe uitdagingen! Met ruime motivatie en toekomstige werkgevers om indruk op te maken, heb ik resoluut besloten om mijn credenties te verrijken met de accolades van een bachelor. Na mijn eerste jaar, toonde ik weer mijn vaart met een fenomenaal score gemiddelde van 77% na mijn eerste jaar. Zelfs Frans, wat ik na 6 jaar van verwaarlozing vreesde als een onoverkomelijk struikelblok voor deze richting, deed weinig om mij op te houden. Ik heb het volste vertrouwen dat ik wederom, met onderscheiding, mijn diploma kan binnen te halen, en vervolgens met vastberadenheid de arbeidsmarkt in te stappen!",
  "Certiline": "Mijn allereerste werkervaring bestond uit het oplossen van problemen en optimaliseren van pc's en laptops van particuliere klanten, evenals het assisteren bij het implementeren en configureren van zakelijke netwerken. Dit was een eenvoudige stage van korte duur als onderdeel van mijn middelbare schoolopleiding.",
  "Almet": "Nadat ik een einde had gemaakt aan mijn eerste bachelor, nam ik deze baan aan om de kloof te overbruggen tussen dit en de volgende bachelor. Het bleek mijn geestelijke gezondheid nieuw leven in te blazen en stelde me eindelijk in staat om iets terug te doen voor degenen die me dierbaar zijn. Als magazijnmedewerker fungeerde ik als een allround hulp bij verschillende montage-, productie- en tilgerelateerde taken in het fabrieksgedeelte van Almet.",
  "SoftAdvice": "Stage voor mijn graduaatdiploma Voor deze stage moest ik een webportaal ontwikkelen voor het Document Management System M-Files, zodat mensen zonder een M-Files-licentie toegang konden krijgen tot aangeduide bestanden uit een kluis. Ik werkte grotendeels zelfstandig en was voornamelijk verantwoordelijk voor het uitwerken en plannen van het project.",
  "VanGenechten": "Stage voor mijn bachelorsdiploma. Voor deze stage moest ik samenwerken met een andere stagiair om een intern programma genaamd de RuleEngine te herbouwen. Deze RuleEngine stelt mensen in staat om snel alarmen te configureren voor de sensor systemen in de VanGenechten-fabriek. Binnen dit tweekoppige team was ik voornamelijk verantwoordelijk voor functionele analyse, architectuur en schaalbare programmeeroplossingen, terwijl implementatie en ontwerp grotendeels werden afgehandeld door mijn mede stagiair.",
  "Unity Junior": "Tussen het einde van de examens van 2020 en het begin van mijn stage heb ik de vaardigheden van een Associate Programmeur voor Unity verworven door gebruik te maken van hun Junior Programmeur leertraject.",
  "Drupal Certificate": "Aan het einde van de Drupal-cursus, die ik heb afgerond als onderdeel van mijn PPP-cursus, heb ik het officiële Udemy-certificaat behaald.   ",
  "DotNet Experience": "5 jaar ervaring, inclusief stage, met verschillende frameworks zoals Unity, Monogame, ASP.Net, WPF en anderen. Mijn stage bij SoftAdvice bestond bijna uitsluitend uit het werken met ASP.Net.",
  "React Experience": "6 maanden ervaring met React 15 tijdens mijn graduaat diploma en nog eens 8 maanden ervaring tijdens mijn Bachelor met React 17+. Mijn stage bij VanGenechten werd voornamelijk gedaan met React in zowel TypeScript als JavaScript, en mijn semesterlange groepsproject in opdracht van VITO RemoteSense werd op vergelijkbare wijze gerealiseerd met behulp van dit framework.",
  "SQLDb Experience": "Verschillende cursussen (aangezien dit een integraal onderdeel is van bijna elke IT-opleiding) en sporadisch gebruik in verschillende producten. Ervaring met zowel PostgreSQL als standaard SQL.",
  "Java Experience": "Twee semesterlange cursussen in het Spring Boot + Thymeleaf-framework tijdens mijn bachelorsdiploma.",
  "Angular Experience": "Een cursus in Angular + Ionic tijdens mijn graduaatdiploma, en nog een Angular-cursus tijdens mijn bachelorsdiploma.",
  "Python Experience": "Onregelmatige ervaring in verschillende cursussen, voornamelijk op het gebied van IoT-ontwikkeling en AI-programmering. Beperkte ervaring in het programmeren van API's op basis van FastAPI.",
  "Vue Experience": "Als onderdeel van mijn PPP-cursussen heb ik een beginnerscursus gevolgd voor Vue van CodeClassrooms.",
  "PHP Experience": "Twee semesters durende cursussen in het Laravel-framework tijdens mijn bacheloropleiding",
  "Dart Experience": "Eén semester ervaring met het programmeren van AR-toepassingen met Dart en Flutter",
  "VB Experience": "Geloof het of niet, dit is de taal waarin ik heb leren programmeren tijdens mijn middelbare school.",
  "IOT Experience": "Ervaring in twee cursussen tijdens mijn eerste bachelor en één cursus tijdens mijn meest recente bachelor. Kennis van zowel Arduino als Raspberry Pi met behulp van verschillende sensoren.",
  "Git Experience": "Doorlopende ervaring in al mijn programmeer gerelateerde cursussen",
  "SalesForce Experience": "In mijn meest recente bachelor heb ik het SalesForce Admin Superset afgerond",
  "Cisco Experience": "Drie semesterlange cursussen tijdens mijn eerste bacheloropleiding, gericht op het opzetten en configureren van Cisco-routers",
  "AI Experience": "Eén semesterlange cursus tijdens mijn meest recente bachelor, en uitgebreide praktische toepassing tijdens ons semesterproject",
  "DevOps Experience": "Onregelmatige ervaring in al mijn IT-gerelateerde cursussen en tijdens mijn meest recente stage. Bekend met het gebruik van Docker en Kubernetes. Enige kennis van het opzetten van deployment-pijplijnen voor Github en Gitlab, evenals het opzetten van scripts voor deployment en publicatie",
  "ITIL Experience": "Ik heb het ITIL Cursus afgemaakt. Tweemaal. Jammer genoeg werd het niet erkent als vrijstelling voor mijn bachelor vanwege dat het behandeld werd binnen de generieke 'IT-Topics' cursus. En dus, om mijn studiekredenties ervoor te behalen het ik het moeten herhalen binnen de bachelor.",
  "Electronics Experience": "Drie semesterlange cursussen tijdens mijn eerste bachelor, evenals terugkerend contact hiermee tijdens mijn IoT-cursus in mijn meest recente bachelor",
  "SAP Experience": "Introductiecursus in SAP gevolgd als onderdeel van mijn meest recente bachelor.",
  "Drupal Experience": "Introductiecursus in Drupal gevolgd als onderdeel van mijn meest recente bachelor.",
  "Project Management Experience": "Onregelmatige ervaring in al mijn IT-gerelateerde cursussen en mijn persoonlijke projecten. Voornamelijkste projectplanner tijdens beide stages",
  "Agile Experience": "Onregelmatige ervaring in al mijn IT-gerelateerde cursussen",
  "Conversation Experience": "Tijdens mijn jaar Toegepaste Psychologie ben ik getraind in verschillende waardevolle communicatievaardigheden, zoals het geven van feedback, het presenteren van slecht nieuws, het analyseren en afhandelen van klachten en het communiceren met teamgenoten, evenals het reflecteren op mijn eigen prestaties en gedrag op professioneel gebied.",
  "Training Experience": "Als deel van mijn bachelorsdiploma, heb ik een trainingssessie moeten geven in het volwassenenonderwijs over cybersecurity",
  "RuleEngine Project Description 1": "De RuleEngine was een administratieve webtool die ik samen met een andere stagiair moest ontwerpen voor mijn stage bij VanGenechten. De applicatie was bedoeld om de fabriekssensoren snel te kunnen configureren met specifieke regels en waarschuwingen. De applicatie is volledig ontworpen in React JavaScript, met de componenten ontworpen in Bit.dev React, een op TypeScript gebaseerd componentenframework. De door ons gemaakte componenten moesten in de toekomst herbruikbaar zijn zonder uitgebreide kennis van React te vereisen, en daarom automatisch velden, rijen en bedieningselementen kon genereren op basis van de invoer van het component.",
  "RuleEngine Project Description 2": "Als de meer ervaren van de twee stagiairs (waarvan de tweede stagiair afkomstig was van de graduaat opleiding), was ik verantwoordelijk voor de meer technisch veeleisende taken van het project, zoals het uitvoeren van de functionele analyse, het schrijven van de code voor de automatische generatie van elementen en de architectuur van onze pagina's, en het schrijven van scripts voor automatisering en database testing.",
  "CodeFarm Project Description 1": "'CodeFarm' was onze interne naam voor het Project 4.0 semesterproject. We kregen de opdracht van VITO RemoteSense om een app te ontwerpen waarmee je foto's kon maken van aardbeienbloemen met een gsm, deze kon tellen met behulp van beeldherkenning en vervolgens deze informatie kon opslaan en visualiseren op een dashboard. Het project bestond uit een voorbereidingsperiode van 3 maanden waarin we al het nodige onderzoek, ontwerp en planning hebben gedaan, en een realisatiefase van 3 weken waarin iedereen fulltime aan het project werkte.",
  "CodeFarm Project Description 2": "Voor dit project werkten we in een multidisciplinair, internationaal team van 2 front-end specialisten, 2 AI-specialisten en 2 cybersecurityspecialisten. Binnen het front-end team werkten we met een 2-pass systeem, waarbij de andere programmeur verantwoordelijk was voor snelle integratie, het maken van snelle basisversies van onze pagina's die direct konden worden gebruikt voor integratie en testen door de andere teams, terwijl ik deze secties verder uitwerkte door de code op te schonen, de look en feel te verbeteren en in lijn te brengen met de rest van de applicatiestijl.",
  "SalesForce Deloitte Project Description 1": "Dit groepsproject werd in opdracht van Deloitte uitgevoerd als onderdeel van onze SalesForce-cursus. We moesten een volledige SalesForce-applicatie configureren voor het fictieve bedrijf Equibel, waar twee vertegenwoordigers van Deloitte als onze klanten optraden. Aan het einde van het traject moesten we onze voltooide oplossing presenteren aan een jury in het hoofdkantoor van Deloitte op de luchthaven van Zaventem.",
  "MFiles Project Description 1": "MFiles is een documentbeheersysteem waarvoor het bedrijf waar ik stage liep, SoftAdvice, als consultant optrad. Om het gemakkelijker te maken om documenten van buiten het bedrijf te benaderen, vroegen ze me om een op ASP.Net gebaseerd webportaal te ontwerpen voor MFiles waarmee je bestanden uit de documentopslagplaats kunt ophalen en mogelijk kunt bijwerken zonder zelf toegangsreferenties nodig te hebben.",
  "MFiles Project Description 2": "Dit project werd grotendeels zelfgestuurd en zelfbeheerd, met minimaal toezicht van het bedrijf behalve wekelijkse check-ups. Uiteindelijk had het weinig zin om het in productie te brengen, omdat het bedrijf achter MFiles had besloten om aan te kondigen dat ze hun eigen webportaal voor MFiles gingen ontwikkelen.",
  "GemTD Project Description 1": "Tijdens mijn graduaatdiploma heb ik veel geëxperimenteerd met het coderen van gameontwikkeling. Ik begon eerst met het Monogame-framework, waar ik een eenvoudige op geometrie gebaseerde platformer heb ontworpen, maar ben toen overgestapt naar Unity om iets beter gedocumenteerd te proberen. Ik verdiende het Junior Unity Programmer-badge en na een paar mislukte pogingen heb ik een herinterpretatie gemaakt van een oude flashgame die ik vroeger speelde: GemTD, een tower defense-spel waarbij je elke beurt 5 mineralen kreeg om op de kaart te plaatsen (die diende als verdedigingstorens), waarvan alle behalve één in rotsen zouden veranderen. Deze zouden vervolgens dienen als permanente obstakels voor de vijanden waar je je tegen moest verdedigen, en gedurende vele beurten kon je uiteindelijk ingewikkelde doolhoven maken om vijanden zo lang mogelijk van de checkpoints weg te houden.",
  "GemTD Project Description 2": "Naar mijn eigen schatting heeft het project in totaal ongeveer 140 uur in beslag genomen, verdeeld over 2 maanden, om het van start tot een bruikbare alfaversie te brengen, waarna het project werd stopgezet vanwege de toenemende druk van schoolwerk. Het project is gepubliceerd op itch.io: ",
  "VGP description 1": "VanGenechten is een van de grootste namen op de verpakkingsmarkt, met vestigingen in 10 verschillende landen en klanten in meer dan 15 landen. In termen van productie verkopen ze een grote variatie aan geprinte verpakkingen. Boven op deze productie leveren ze ook een variatie van diensten die in verband staan met deze kernactiviteit; zoals consultancy binnen supply chain management, co-packaging en designconsultancy. Ze zijn origineel in 1834 gesticht.",
  "VGP description 2": "Onder VanGenechten bestaat IMAS nv, een legaal aparte entiteit die puur instaat voor het ontwerpen en ondersteunen van software voor VanGenechten, zoals monitoring software, het bijhouden van het in-house “Fenics” ERP pakket, en de IT-infrastructuur onderhouden en uit breiden.",
  "VGP description 3": "Op moment van de stage bestond het kernteam van IMAS uit de Java programmeurs voor het Fenics pakket en de SmartFactory sensor panelen, en een devops team voor het onderhouden van de verschillende servers, virtual machines en pipelines die deze nodig hebben. Binnenkort wordt dit uitgebreid met een tweede team die Fenics gaat omzetten naar een cloud-based javascript solution.",
  "SoftAdvice description 1": "SoftAdvice is een IT-Consultancy firma in Turnhout. Ze specialiseren zich voornamelijk in het distribueren, implementeren en ondersteunen van de DMS M-Files en de ERP WorkBook. Momenteel heeft het bedrijf 8 werknemers in dienst en word het gezien als kmo. Hun voornamelijkste doelpubliek zijn dan ook middelgrote bedrijven die nood hebben aan DMS-ondersteuning en andere digitalisatie oplossingen.",
  "SoftAdvice description 2": "Naast ook strikt consultancywerk zijn er ook programmeurs werkzaam binnen SoftAdvice die applicaties schrijven om verdere functionaliteit aan M-Files te voorzien. SoftAdvice is al 20 jaar werkzaam als consultancy bedrijf. "
}
