{
  "Change Style": "Change Style",
  "Bryant Suiskens": "Bryant Suiskens",
  "About Me": "About Me",
  "Where I've Been": "Where I've been",
  "Skills": "Skills",
  "Internship": "Internship",
  "Projects": "Projects",
  "Welcome Message":"Welcome to the Portfolio of Bryant Suiskens",
  "Roles Message": "Front-end developer and application engineer",
  "Invitation Message": "Get to know me",
  "October 15th": "October 15th",
  "My Hobbies": "My Hobbies",
  "Born": "Born",
  "Phone": "Phone",
  "Contact": "Contact",
  "January": "January",
  "February": "February",
  "March": "March",
  "April": "April",
  "May": "May",
  "June":  "June",
  "Juli": "Juli",
  "August": "August",
  "September": "September",
  "October": "October",
  "November": "November",
  "December": "December",
  "Relevant Documents": "Relevant Documents",
  "Educational Tracks": "Educational Tracks",
  "Work Experience": "Work Experience",
  "Certifications": "Certifications",
  "AP IT Bachelor": "Bachelor Electronics/IT at Artesis-Plantijn College",
  "TM TP Bachelor": "Bachelor Applied Psychology at Thomas More College",
  "TM IT Graduate": "Graduate degree Programming at Thomas More College",
  "TM IT Bachelor": "Bachelor Application Development at Thomas More College",
  "Warehouse Assistant": "Warehouse Assistant",
  "React Programmer": "React Programmer", 
  "Programming Skills": "Programming Skills",
  "IT Skills": "IT Skills",
  "Soft Skills": "Soft Skills",
  "My Skills": "My Skills",
  "Beginner": "Beginner",
  "Moderate": "Moderate",
  "Specialist": "Specialization",
  "Experienced": "Experienced",
  "Former Specialist": "Former Specialization",
  "Deprecated": "Deprecated",
  "Conversation Skills": "Conversation Skills",
  "Electronics": "Electronics",
  "Cisco Networks": "Cisco Networks",
  ".NET Development in C#": ".NET Development in C#",
  "IoT Development": "IoT Development",
  "Internships": "Internships",
  "Assignment": "Assignment",
  "Bachelor Internship": "Bachelor Internship",
  "Graduate Internship": "Graduate Internship",
  "My Projects": "My Projects",
  "Biography": "I am a highly motivated and diligent worker, known for my unique personality and unwavering optimism. Former colleagues and classmates often describe me as animated, hardworking, and detail-oriented. I strongly believe in fostering a collaborative environment, ensuring that every team member feels valued and actively involved in our projects.",
  "About My Hobbies": "In addition to working on individual programming projects, such as Unity game development, I make sure to allocate my free time effectively. I enjoy indulging in activities like playing video games, going to the gym, and exploring my passion for baking. Every week, I challenge myself to create a diverse range of mouthwatering pastries. However, the resulting batches are often too generous for my own family's consumption. Therefore, it has become a common practice for me to share the fruits of my labor with friends and colleagues, spreading the joy and deliciousness among them. ",
  "Bachelor AP": "My initial start after secondary education was a 3 year swing at a Bachelors degree. Despite a stellar first year, personal circumstances led to a burnout during the second year. I kept putting myself in stressful situations through rampant procrastination that quickly became unmanageable during the second year, and had slowly been alienating what few friends I managed to make. After starting with psychological aid and medication after a year of struggle, I realized my passion for IT was (for now) extinguished, and I took the second semester as a sabbatical, working to get my mental health and motivation to the unshakable flame it is now known as.",
  "Bachelor Psychology": "To sharpen up my social skills and communicative capabilities, I then started this bachelor. Newly motivated and having learned the harsh lessons of my first bachelor, I applied myself socially with great success. The character development displayed during this year has truly been life changing. Alas, the bachelor was doomed; once we left the theoretical and started with the practical, it became obvious I still had much to learn, more than I could within the few months afforded to me. After a particularly catastrophic failure of a practical exam, I had to face reality and move back into my lane. With this new life experience and a renewed motivation, I returned to programming with a vengeance!",
  "Graduate Programming": "From the start all up until the end of the course, I stood as one of the top programmers of my class. Previously hobbled with a lack of motivation, rampant procrastination and a total lack of social initiative, I now attend to my studies with a vigor that would have been alien to my past self, see my projects delivered on time and with grace, and have stepped up to become a pillar of the classroom, making friends wherever I go. Truly, these two years have been among finest, and left no doubt about my future career as a programmer. At the end of the trajectory, I proudly graduated with great distinction.",
  "Bachelor Programming":"And off to new horizons we went! With ample motivation left and future employers to impress, I resolutely have gone on to extend my graduate degree with the accolades of the bachelor degree. After my first year, I once again showed my strengths by averaging out on a phenomenal 77% score. Even my French course, something I didn't have for 6 years and wasn't particularly good at at the end of my secondary education, didn't hamper my momentum. I feel confident in again, with distinction, finishing this degree without delay before boldly stepping into the labor market!",
  "Certiline":"My very first work experience, where I took care of troubleshooting and optimizing the pc’s and laptops of private customers, as well as aiding and assisting in the deployment and configuration of business networks. This was a simple short-duration internship as part of my secondary education.",
  "Almet":"After putting a stop to my first bachelor, I took on this job to close the gap between this and the next bachelor. It turned out to revitalize my mental health and allowed me to finally give back to those near and dear to me. As warehouse assistant, I acted as all-round aid for the variety of assembly, production and lifting related tasks throughout the factory section of Almet.",
  "SoftAdvice":"Internship for the graduate degree. For this internship, I had to deliver a webportal for the Document Management System M-Files, to allow people without an M-Files license to access select files from a vault. I worked mostly independent, and was chiefly responsible for conceptualizing and planning the project.",
  "VanGenechten":"Internship for the bachelor degree. For this internship, I had to work together with another intern to revise an in-house program known as the rule engine, which allows people to quickly configure alerts for the sensor systems in the VanGenechten factory. Within this 2-headed team, I was chiefly responsible for functional analysis, architecture and scalable programming solutions, while implementation and design was mostly handled by my fellow intern.",
  "Unity Junior":"Between the end of the exams of 2020 and the start of my internship, got the skills of a Associate Programmer for Unity using their Junior Programmer learning pathway.",
  "Drupal Certificate":"Official Udemy certificate has been achieved at the end of the Drupal course that I finished as part of my PPP course:   ",
  "DotNet Experience":"5 years of experience, including internship, with a variety of frameworks like Unity, Monogame, ASP.Net, WPF and others. Internship at SoftAdvice was done almost exclusively in ASP.Net",
  "React Experience": "6 months of experience in React 15 during my graduate degree, and another 8 months of experience during my Bachelor in React 17+. My internship at VanGenechten predominantly was done using React in both typescript and javascript, and my semester-long groupproject commissioned by VITO RemoteSense was similiarly realized in this framework",
  "SQLDb Experience":"Several courses (due to this being an integral part of almost every IT degree) and intermittend usage throughout a variety of products. Experienced in both PostgreSQL and standard SQL",
  "Java Experience": "Two semester-long courses in the Spring Boot + Thymeleaf framework during my bachelor degree",
  "Angular Experience": "A course in Angular + Ionic in the graduate degree, and another Angular course in the bachelor degree",
  "Python Experience": "Intermittend experience across a variety of courses, primarily in IoT development and AI programming. Limited experience in programming FastApi-based API's",
  "Vue Experience": "A beginner course was followed for Vue as part of my PPP courses, from CodeClassrooms: ",
  "PHP Experience": "Two semester-long courses in the Laravel framework during my bachelor degree",
  "Dart Experience": "One semester of experience in programming AR applications using Dart and Flutter",
  "VB Experience": "Believe it or not, this is the language in which I learned to program back in my secondary education.",
  "IOT Experience": "Experience across two courses in my initial bachelor and one course in my latest bachelor. Knowledgable in both Arduino and Raspberry Pi using a variety of sensors",
  "Git Experience": "Consistent experience across all my programming related courses",
  "SalesForce Experience": "Achieved the Salesforce Admin Superset during my latest bachelor degree",
  "Cisco Experience": "Three semester-long courses during my first bachelor education, in setting up and configuring Cisco-based routers",
  "AI Experience": "One semester-long course of experience during my latest bachelor, and extensive practical application during our semester project",
  "DevOps Experience": "Intermittend experience across all my IT related courses and during my most recent internship. Knowledgeable in the usage of Docker and Kubernetes. Somewhat knowledgable in setting up Github and Gitlab deployment pipelines, as well as setting up scripts for deployment and publishing",
  "ITIL Experience": "I did the ITIL course. Twice. Sadly due to my graduate degree doing it as part of the generic IT Topics course, it was not seen as a valid exemption. So to get properly acreddited for it, I had to do it yet again",
  "Electronics Experience": "Three semester-long courses during my initial bachelor, as well as recurring contact with it during my IoT course in my latest bachelor",
  "SAP Experience": "Introductory course to SAP followed as part of my latest bachelor.",
  "Drupal Experience": "Introductory course to Drupal followed as part of my latest bachelor.",
  "Project Management Experience": "Intermittend experience across all my IT related courses and my personal projects. Primary project manager during both my internships",
  "Agile Experience": "Intermittend experience across all my IT related courses",
  "Conversation Experience": "During my year of Applied Psychology, I have been trained in a variety of valuable communication skills such as delivering feedback, presenting bad news, analyzing and handling complaints and communicating with teammates, as well as reflecting on my own performance and behavior in a professional sense.",
  "Training Experience": "As part of my bachelor course, I've given a training session on cyber security to a class of students",
  "RuleEngine Project Description 1": "The RuleEngine was an administrative webtool that I had to design together with another intern for my internship at VanGenechten. The application was meant to be used to quickly configure the factory sensors with specific rules and alerts. The application was designed entire in React Javascript, with the components designed in Bit.Dev React, a TypeScript-based component framework. The components we created had to be reusable in the future without requiring extensive knowledge of react, and as such would have to automatically generate fields, rows and control elements based on the input of the component.",
  "RuleEngine Project Description 2": "Being the more experienced of the two interns (with the second intern being from the graduate course), I was in charge of the more technically taxing tasks of the project, such as carrying out the functional analysis, writing the code for the automatic generation of elements and the architecture of our pages, and writing scripts for code automation and database testing.",
  "CodeFarm Project Description 1": "'CodeFarm' was our internal name for the Project 4.0 course semester project. We had gotten the task from VITO RemoteSense to design an app with which you could take pictures on a phone of strawberry flowers, count them using image recognition and then save and visualize this information on a dashboard. The project consisted out of a 3 month long preparation period where we did all the appropriate research, design and planning, and a 3-week long realization phase where everyone was present full-time to work on the project.",
  "CodeFarm Project Description 2": "For this project, we worked in a multi-disciplinary, international team of 2 front-end specialists, 2 AI-specialists and 2 cybersecurity specialists. Within the front-end team we worked with a 2-pass system, where the other programmer was in charge of rapid integration, creating quick barebones versions of our pages which could immediately be used for integration and testing by the other teams, while I polished these sections by cleaning up the code, improving the look and feel and bringing it in line with the rest of the application style-wise.",
  "SalesForce Deloitte Project Description 1": "This group project was comissioned by Deloitte as part of our SalesForce course. We had to configure a full SalesForce application for the fictitious company Equibel, where two Deloitte representatives would stand in as our customers. At the end of the trajectory we had to present our finalized solution to a jury within the headquarters of Deloitte in Zaventem Airport.",
  "MFiles Project Description 1": "MFiles is a document management system for which the company I was interning for, SoftAdvice, acted as a consultancy for. In order to make accessing documents from outside of the company easier, they asked me to design an ASP.Net based web portal for MFiles that would allow you to get and possibly update files of the document vault without needing access credentials yourself.",
  "MFiles Project Description 2": "This project was mostly self-guided and self-managed, with minimal guidance from the company aside from weekly checkups. Ultimately, there was very little point in bringing it into production as the company behind MFiles had decided to announce that they were developing their own web portal for MFiles.",
  "GemTD Project Description 1": "During my graduate degree, I dabbled a lot with game development coding. I first started on the Monogame framework where I designed a simple geometric based platformer, but then moved on to Unity to try something better documented. I earned the Junior Unity Programmer badge, and after a few missed attempts, I created a reinvisioning of an old flash game I used to play; GemTD, a tower defence game where every turn you would get 5 minerals to place on the map and have all but one of them revert into rocks. These would then act as persistent obstacles for the enemies you'd have to defend against, and across the many turns you could eventually craft elaborate mazes to keep enemies off the checkpoints for as long as possible.",
  "GemTD Project Description 2": "By my own estimation, the project took about 140 hours in total spread across 2 months to bring from start into a servicable alpha state, after which the project was dropped due to the mounting pressure of school work. The project has been published on itch.io: ",
  "VGP description 1": "VanGenechten is one of the biggest names in the packaging market, with establishments in 10 different countries and customers in over 15 countries. They offer a wide range of printed packaging products. In addition to their production activities, they also provide various services related to their core business, such as supply chain management consultancy, co-packaging, and design consultancy. The company was originally founded in 1834.",
  "VGP description 2": "Within VanGenechten, there is a separate legal entity called IMAS nv, which is solely responsible for designing and supporting software for VanGenechten. This includes monitoring software, maintaining the in-house 'Fenics' ERP package, and expanding and maintaining the IT infrastructure.",
  "VGP description 3": "At the time of the internship, the core team of IMAS consisted of Java programmers for the Fenics package and the SmartFactory sensor panels, as well as a DevOps team responsible for maintaining the various servers, virtual machines, and pipelines required for these systems. Soon, a second team will be added to convert Fenics into a cloud-based JavaScript solution.",
  "SoftAdvice description 1": "SoftAdvice is an IT consultancy firm located in Turnhout. They specialize primarily in distributing, implementing, and supporting the DMS M-Files and the ERP WorkBook. Currently, the company has 8 employees and is considered a small to medium-sized enterprise (SME). Their main target audience consists of medium-sized companies in need of DMS support and other digitization services.",
  "SoftAdvice description 2": "In addition to their consultancy work, SoftAdvice also has programmers who develop applications to enhance the functionality of M-Files. The company has been operating as a consultancy firm for 20 years."
}
